AlfredKrutina/chess_esp32_c6_devkit/components/stm32_i2c_bootloader/stm32_i2c_bl.c
#include "stm32_i2c_bl.h"
#include "driver/gpio.h"
#include "driver/i2c.h"
#include "esp_check.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "sdkconfig.h"
#include <inttypes.h>
#include <string.h>

#if CONFIG_CHESS_STM32_I2C_BL_ENABLE && CONFIG_CHESS_STM32_BL_AUTO_FLASH_ON_BOOT
#include "esp_partition.h"
#include "esp_rom_crc.h"
#include "nvs.h"
#endif

#if CONFIG_CHESS_STM32_I2C_BL_ENABLE

static const char *TAG = "STM32_I2C_BL";

extern bool matrix_scanning_enabled;

#define STM32_ACK 0x79
#define STM32_NACK 0x1F
#define STM32_BUSY 0x76

#define NRST_CFG(seg)                                                          \
  ((seg) == 0                                                                \
       ? CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG0                                  \
       : (seg) == 1                                                            \
             ? CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG1                            \
             : (seg) == 2                                                      \
                   ? CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG2                      \
                   : CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG3)

static bool s_inited;

static i2c_port_t bl_port(void) {
#if CONFIG_CHESS_STM32_BL_SHARE_I2C_HALL
  return (i2c_port_t)CONFIG_CHESS_HALL_I2C_PORT_NUM;
#else
  return (i2c_port_t)CONFIG_CHESS_STM32_BL_I2C_PORT_NUM;
#endif
}

static uint8_t bl_addr7(void) {
  return (uint8_t)CONFIG_CHESS_STM32_BL_TARGET_ADDR7;
}

static void bl_pause_scan(bool *was_enabled) {
  *was_enabled = matrix_scanning_enabled;
  matrix_scanning_enabled = false;
  vTaskDelay(pdMS_TO_TICKS(30));
}

static void bl_resume_scan(bool was_enabled) {
  matrix_scanning_enabled = was_enabled;
}

static void bl_inter_frame(void) {
  vTaskDelay(pdMS_TO_TICKS(CONFIG_CHESS_STM32_BL_INTER_FRAME_MS));
}

static uint8_t bl_xor_buf(const uint8_t *p, size_t n) {
  uint8_t x = 0;
  for (size_t i = 0; i < n; i++) {
    x ^= p[i];
  }
  return x;
}

static esp_err_t bl_i2c_write(const uint8_t *data, size_t len) {
  return i2c_master_write_to_device(bl_port(), bl_addr7(), data, len,
                                    pdMS_TO_TICKS(500));
}

static esp_err_t bl_i2c_read(uint8_t *data, size_t len, int timeout_ms) {
  return i2c_master_read_from_device(bl_port(), bl_addr7(), data, len,
                                     pdMS_TO_TICKS(timeout_ms));
}

static esp_err_t bl_wait_ack(uint32_t timeout_ms) {
  const TickType_t end = xTaskGetTickCount() + pdMS_TO_TICKS(timeout_ms);
  unsigned busy_cnt = 0;
  for (;;) {
    uint8_t b = 0;
    esp_err_t e = bl_i2c_read(&b, 1, 120);
    if (e != ESP_OK) {
      ESP_LOGW(TAG, "[bl] čtení ACK: %s", esp_err_to_name(e));
      return e;
    }
    if (b == STM32_ACK) {
      if (busy_cnt) {
        ESP_LOGI(TAG, "[bl] ACK po %u× BUSY (0x76)", busy_cnt);
      }
      return ESP_OK;
    }
    if (b == STM32_NACK) {
      ESP_LOGW(TAG, "[bl] NACK (0x1F)");
      return ESP_FAIL;
    }
    if (b == STM32_BUSY) {
      if ((busy_cnt % 20u) == 0u && busy_cnt > 0) {
        ESP_LOGI(TAG, "[bl] čekám na dokončení (BUSY × %u)…", busy_cnt);
      }
      busy_cnt++;
      vTaskDelay(pdMS_TO_TICKS(10));
      continue;
    }
    ESP_LOGW(TAG, "[bl] neočekávaný bajt 0x%02x", b);
    if (xTaskGetTickCount() >= end) {
      ESP_LOGE(TAG, "[bl] timeout ACK/BUSY");
      return ESP_ERR_TIMEOUT;
    }
  }
}

static esp_err_t bl_send_command_byte_pair(uint8_t cmd) {
  ESP_LOGI(TAG, "[bl] příkaz 0x%02X / ~0x%02X → I2C write", cmd,
           (unsigned)(uint8_t)~cmd);
  uint8_t pair[2] = {cmd, (uint8_t)~cmd};
  esp_err_t e = bl_i2c_write(pair, sizeof(pair));
  if (e != ESP_OK) {
    ESP_LOGE(TAG, "[bl] I2C write cmd selhal: %s", esp_err_to_name(e));
    return e;
  }
  bl_inter_frame();
  e = bl_wait_ack(800);
  if (e != ESP_OK) {
    ESP_LOGE(TAG, "[bl] ACK po cmd 0x%02X: %s", cmd, esp_err_to_name(e));
  } else {
    ESP_LOGI(TAG, "[bl] ACK OK po cmd 0x%02X", cmd);
  }
  return e;
}

/** GO příkaz — čip už musí být v ROM bootloaderu (bez select/release). */
static esp_err_t bl_send_go_at_addr(uint32_t addr) {
  esp_err_t err = bl_send_command_byte_pair(0x21);
  if (err != ESP_OK) {
    return err;
  }

  uint8_t ab[4] = {(uint8_t)(addr >> 24), (uint8_t)(addr >> 16),
                   (uint8_t)(addr >> 8), (uint8_t)addr};
  uint8_t aw[5];
  memcpy(aw, ab, 4);
  aw[4] = bl_xor_buf(ab, 4);
  bl_inter_frame();
  err = bl_i2c_write(aw, sizeof(aw));
  if (err != ESP_OK) {
    return err;
  }
  bl_inter_frame();
  return bl_wait_ack(500);
}

/**
 * WRITE MEMORY — předpoklad: cílový segment už vybrán NRST, bez uvolnění sběrnice.
 */
static esp_err_t bl_write_memory_payload(uint32_t addr, const uint8_t *data,
                                         size_t len) {
  ESP_RETURN_ON_FALSE(len > 0 && len <= 256, ESP_ERR_INVALID_ARG, TAG,
                      "payload len");

  ESP_LOGI(TAG, "[write] WRITE MEMORY addr=0x%08" PRIx32 " len=%u", addr,
           (unsigned)len);

  esp_err_t err = bl_send_command_byte_pair(0x31);
  if (err != ESP_OK) {
    return err;
  }

  uint8_t ab[4] = {(uint8_t)(addr >> 24), (uint8_t)(addr >> 16),
                   (uint8_t)(addr >> 8), (uint8_t)addr};
  uint8_t aw[5];
  memcpy(aw, ab, 4);
  aw[4] = bl_xor_buf(ab, 4);
  bl_inter_frame();
  err = bl_i2c_write(aw, sizeof(aw));
  if (err != ESP_OK) {
    return err;
  }
  bl_inter_frame();
  err = bl_wait_ack(1500);
  if (err != ESP_OK) {
    return err;
  }

  uint8_t nbyte = (uint8_t)(len - 1u);
  uint8_t pkt[1 + 256 + 1];
  pkt[0] = nbyte;
  memcpy(pkt + 1, data, len);
  pkt[1 + len] = bl_xor_buf(pkt, 1 + len);

  bl_inter_frame();
  err = bl_i2c_write(pkt, (size_t)(1 + len + 1));
  if (err != ESP_OK) {
    return err;
  }
  bl_inter_frame();
  err = bl_wait_ack(5000);
  if (err == ESP_OK) {
    ESP_LOGI(TAG, "[write] blok na 0x%08" PRIx32 " (%u B) — hotovo", addr,
             (unsigned)len);
  }
  return err;
}

/** Po i2c_param_config / install — výslovně zapne interní pull-up na nožičkách sběrnice. */
static void bl_apply_bus_pullups(int sda_gpio, int scl_gpio) {
  if (sda_gpio < 0 || scl_gpio < 0) {
    return;
  }
  esp_err_t e1 =
      gpio_set_pull_mode((gpio_num_t)sda_gpio, GPIO_PULLUP_ONLY);
  esp_err_t e2 =
      gpio_set_pull_mode((gpio_num_t)scl_gpio, GPIO_PULLUP_ONLY);
  if (e1 != ESP_OK || e2 != ESP_OK) {
    ESP_LOGW(TAG, "I2C pull-up SDA=%d SCL=%d: %s / %s", sda_gpio, scl_gpio,
             esp_err_to_name(e1), esp_err_to_name(e2));
  }
}

