AlfredKrutina/chess_esp32_c6_devkit/components/stm32_i2c_bootloader/stm32_i2c_bl.c
static void bl_configure_nrst_pin(int pin, bool output_high) {
  if (pin < 0) {
    return;
  }
  gpio_num_t g = (gpio_num_t)pin;
  gpio_reset_pin(g);
  gpio_set_direction(g, GPIO_MODE_OUTPUT);
  gpio_set_level(g, output_high ? 1 : 0);
}

esp_err_t stm32_i2c_bl_init(void) {
  if (s_inited) {
    return ESP_OK;
  }

#if !CONFIG_CHESS_STM32_BL_SHARE_I2C_HALL
  i2c_config_t cfg = {
      .mode = I2C_MODE_MASTER,
      .sda_io_num = CONFIG_CHESS_STM32_BL_I2C_SDA_GPIO,
      .scl_io_num = CONFIG_CHESS_STM32_BL_I2C_SCL_GPIO,
      .sda_pullup_en = GPIO_PULLUP_ENABLE,
      .scl_pullup_en = GPIO_PULLUP_ENABLE,
      .master.clk_speed = CONFIG_CHESS_STM32_BL_I2C_FREQ_HZ,
      .clk_flags = 0,
  };
  ESP_RETURN_ON_ERROR(i2c_param_config(bl_port(), &cfg), TAG,
                      "i2c_param_config");
  esp_err_t er =
      i2c_driver_install(bl_port(), I2C_MODE_MASTER, 0, 0, 0);
  if (er != ESP_OK && er != ESP_ERR_INVALID_STATE) {
    ESP_LOGE(TAG, "i2c_driver_install: %s", esp_err_to_name(er));
    return er;
  }
  bl_apply_bus_pullups(CONFIG_CHESS_STM32_BL_I2C_SDA_GPIO,
                       CONFIG_CHESS_STM32_BL_I2C_SCL_GPIO);
#else
  {
    i2c_config_t cfg = {
        .mode = I2C_MODE_MASTER,
        .sda_io_num = CONFIG_CHESS_HALL_I2C_SDA_GPIO,
        .scl_io_num = CONFIG_CHESS_HALL_I2C_SCL_GPIO,
        .sda_pullup_en = GPIO_PULLUP_ENABLE,
        .scl_pullup_en = GPIO_PULLUP_ENABLE,
        .master.clk_speed = CONFIG_CHESS_STM32_BL_SHARED_I2C_FREQ_HZ,
        .clk_flags = 0,
    };
    esp_err_t er = i2c_param_config(bl_port(), &cfg);
    if (er != ESP_OK) {
      ESP_LOGE(TAG, "shared I2C param: %s", esp_err_to_name(er));
      return er;
    }
    bl_apply_bus_pullups(CONFIG_CHESS_HALL_I2C_SDA_GPIO,
                         CONFIG_CHESS_HALL_I2C_SCL_GPIO);
    /* Driver drží hall_i2c_matrix_init(); druhý i2c_driver_install vrací ESP_FAIL. */
    ESP_LOGI(TAG,
             "STM32 BL sdílí Hall I2C port %d @ %d Hz (Hall init použil %d Hz)",
             (int)bl_port(), CONFIG_CHESS_STM32_BL_SHARED_I2C_FREQ_HZ,
             CONFIG_CHESS_HALL_I2C_FREQ_HZ);
  }
#endif

  ESP_LOGI(TAG, "[init] mapa NRST: seg0=%d seg1=%d seg2=%d seg3=%d",
           CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG0,
           CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG1,
           CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG2,
           CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG3);

  for (unsigned s = 0; s < 4; s++) {
    int p = NRST_CFG(s);
    if (p >= 0) {
      bl_configure_nrst_pin(p, true);
      ESP_LOGI(TAG, "[init] NRST seg%u → GPIO%d (výchozí HIGH = run)", s, p);
    }
  }

  if (CONFIG_CHESS_STM32_BL_BOOT0_GPIO >= 0) {
    gpio_num_t bg = (gpio_num_t)CONFIG_CHESS_STM32_BL_BOOT0_GPIO;
    gpio_reset_pin(bg);
    gpio_set_direction(bg, GPIO_MODE_OUTPUT);
    gpio_set_level(bg, 0);
    ESP_LOGI(TAG, "[init] BOOT0 → GPIO%d (výchozí LOW)", CONFIG_CHESS_STM32_BL_BOOT0_GPIO);
  } else {
    ESP_LOGI(TAG, "[init] BOOT0 GPIO nepřiřazen (-1)");
  }

  s_inited = true;
  ESP_LOGI(TAG,
           "[init] OK | I2C port=%d addr7=0x%02x inter_frame=%d ms",
           (int)bl_port(), bl_addr7(), CONFIG_CHESS_STM32_BL_INTER_FRAME_MS);
  return ESP_OK;
}

esp_err_t stm32_i2c_bl_select_target(uint8_t segment_0_to_3,
                                     bool boot0_enter_bootloader) {
  ESP_RETURN_ON_FALSE(segment_0_to_3 < 4, ESP_ERR_INVALID_ARG, TAG, "seg");
  ESP_RETURN_ON_ERROR(stm32_i2c_bl_init(), TAG, "init");

  if (CONFIG_CHESS_STM32_BL_BOOT0_GPIO >= 0) {
    gpio_set_level((gpio_num_t)CONFIG_CHESS_STM32_BL_BOOT0_GPIO,
                   boot0_enter_bootloader ? 1 : 0);
    ESP_LOGI(TAG, "[select] BOOT0=%s", boot0_enter_bootloader ? "HIGH" : "LOW");
  }

  /*
   * STM vzorkuje BOOT0 při náběžné hře NRST. Pokud byl NRST už HIGH z init a jen
   * přepneme BOOT0, čip neprojde resetem — zůstane v uživatelském bootu (u prázdného
   * flash často „mrtvý“ stav, žádný I²C ROM bootloader). Nutný pulz NRST.
   *
   * Když AUTO_USE_BOOT0=n (BOOT0 jen hardwarově na VDD), boot0_enter_bootloader je z
   * volajícího false, ale pulz NRST pořád potřebujeme — jinak nový čip z obchodu
   * nikdy nevstoupí do system memory.
   */
#if CONFIG_CHESS_STM32_BL_AUTO_USE_BOOT0
  const bool pulse_nrst = boot0_enter_bootloader;
#else
  const bool pulse_nrst = true;
#endif
  if (pulse_nrst) {
    vTaskDelay(pdMS_TO_TICKS(5));
    for (unsigned s = 0; s < 4; s++) {
      int p = NRST_CFG(s);
      if (p < 0) {
        continue;
      }
      gpio_set_level((gpio_num_t)p, 0);
    }
    ESP_LOGI(TAG,
             "[select] NRST všech segmentů LOW (reset pulz; BOOT0=%s), 30 ms",
             boot0_enter_bootloader ? "HIGH (ESP)" : "HW/chování AUTO_USE_BOOT0=n");
    vTaskDelay(pdMS_TO_TICKS(30));
  }

  for (unsigned s = 0; s < 4; s++) {
    int p = NRST_CFG(s);
    if (p < 0) {
      continue;
    }
    bool release = (s == segment_0_to_3);
    gpio_set_level((gpio_num_t)p, release ? 1 : 0);
    ESP_LOGI(TAG, "[select] seg%u GPIO%d → %s", s, p,
             release ? "HIGH (uvolnění resetu)" : "LOW (reset držet)");
  }

  vTaskDelay(pdMS_TO_TICKS(CONFIG_CHESS_STM32_BL_POST_NRST_DELAY_MS));
  ESP_LOGI(TAG,
           "[select] aktivní segment %u, čekání %d ms po uvolnění NRST",
           segment_0_to_3, CONFIG_CHESS_STM32_BL_POST_NRST_DELAY_MS);
  return ESP_OK;
}

esp_err_t stm32_i2c_bl_release_all_run_app(void) {
  ESP_RETURN_ON_ERROR(stm32_i2c_bl_init(), TAG, "init");

  if (CONFIG_CHESS_STM32_BL_BOOT0_GPIO >= 0) {
    gpio_set_level((gpio_num_t)CONFIG_CHESS_STM32_BL_BOOT0_GPIO, 0);
  }

  for (unsigned s = 0; s < 4; s++) {
    int p = NRST_CFG(s);
    if (p >= 0) {
      gpio_set_level((gpio_num_t)p, 1);
    }
  }
  vTaskDelay(pdMS_TO_TICKS(50));
  ESP_LOGI(TAG, "[release] všechny NRST HIGH, BOOT0 LOW, 50 ms");
  return ESP_OK;
}

esp_err_t stm32_i2c_bl_cmd_get_id(uint8_t segment_0_to_3, bool boot0_enter,
                                  uint16_t *pid_out) {
  ESP_RETURN_ON_FALSE(pid_out, ESP_ERR_INVALID_ARG, TAG, "pid");

  bool scan_was = false;
  bl_pause_scan(&scan_was);

  ESP_LOGI(TAG, "[get_id] segment=%u boot0_mode=%d", segment_0_to_3,
           (int)boot0_enter);

  esp_err_t err =
      stm32_i2c_bl_select_target(segment_0_to_3, boot0_enter);
  if (err != ESP_OK) {
    bl_resume_scan(scan_was);
    return err;
  }

  err = bl_send_command_byte_pair(0x02);
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "[get_id] GET_ID cmd fail: %s", esp_err_to_name(err));
    goto done;
  }

  bl_inter_frame();
  uint8_t blk[5];
  memset(blk, 0, sizeof(blk));
  ESP_LOGI(TAG, "[get_id] čtu 5 B odpovědi…");
  err = bl_i2c_read(blk, sizeof(blk), 400);
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "[get_id] read: %s", esp_err_to_name(err));
    goto done;
  }

  ESP_LOGI(TAG, "[get_id] raw: %02X %02X %02X %02X %02X", blk[0], blk[1],
           blk[2], blk[3], blk[4]);

  if (blk[0] != STM32_ACK) {
    ESP_LOGE(TAG, "[get_id] první bajt není ACK (0x%02x)", blk[0]);
    err = ESP_ERR_INVALID_RESPONSE;
    goto done;
  }

