AlfredKrutina/chess_esp32_c6_devkit/components/stm32_i2c_bootloader/stm32_i2c_bl.c
  *pid_out = (uint16_t)(((uint16_t)blk[2] << 8) | blk[3]);
  ESP_LOGI(TAG, "[get_id] PID=0x%04X", (unsigned)*pid_out);
  if (blk[4] != STM32_ACK) {
    ESP_LOGW(TAG, "[get_id] závěrečný bajt 0x%02x (oček. ACK)", blk[4]);
  }

done:
  (void)stm32_i2c_bl_release_all_run_app();
  bl_resume_scan(scan_was);
  return err;
}

esp_err_t stm32_i2c_bl_erase_all(uint8_t segment_0_to_3, bool boot0_enter) {
  bool scan_was = false;
  bl_pause_scan(&scan_was);

  ESP_LOGI(TAG, "[erase_all] segment=%u mass 0xFFFF", segment_0_to_3);

  esp_err_t err =
      stm32_i2c_bl_select_target(segment_0_to_3, boot0_enter);
  if (err != ESP_OK) {
    bl_resume_scan(scan_was);
    return err;
  }

  err = bl_send_command_byte_pair(0x44);
  if (err != ESP_OK) {
    goto done;
  }

  uint8_t nblock[3] = {0xFF, 0xFF, 0x00};
  nblock[2] = bl_xor_buf(nblock, 2);
  bl_inter_frame();
  ESP_LOGI(TAG, "[erase_all] posílám special erase 0xFFFF…");
  err = bl_i2c_write(nblock, sizeof(nblock));
  if (err != ESP_OK) {
    ESP_LOGE(TAG, "[erase_all] write: %s", esp_err_to_name(err));
    goto done;
  }

  bl_inter_frame();
  ESP_LOGI(TAG, "[erase_all] čekám na erase (timeout %d ms)…",
           CONFIG_CHESS_STM32_BL_ERASE_ACK_MS);
  err = bl_wait_ack(CONFIG_CHESS_STM32_BL_ERASE_ACK_MS);
  if (err == ESP_OK) {
    ESP_LOGI(TAG, "[erase_all] dokončeno OK");
  }

done:
  (void)stm32_i2c_bl_release_all_run_app();
  bl_resume_scan(scan_was);
  return err;
}

esp_err_t stm32_i2c_bl_write_memory(uint8_t segment_0_to_3, bool boot0_enter,
                                    uint32_t addr, const uint8_t *data,
                                    size_t len) {
  ESP_RETURN_ON_FALSE(data && len > 0 && len <= 256, ESP_ERR_INVALID_ARG, TAG,
                      "len");

  bool scan_was = false;
  bl_pause_scan(&scan_was);

  esp_err_t err =
      stm32_i2c_bl_select_target(segment_0_to_3, boot0_enter);
  if (err != ESP_OK) {
    bl_resume_scan(scan_was);
    return err;
  }

  err = bl_write_memory_payload(addr, data, len);

  (void)stm32_i2c_bl_release_all_run_app();
  bl_resume_scan(scan_was);
  return err;
}

esp_err_t stm32_i2c_bl_go(uint8_t segment_0_to_3, bool boot0_enter,
                          uint32_t addr) {
  bool scan_was = false;
  bl_pause_scan(&scan_was);

  esp_err_t err =
      stm32_i2c_bl_select_target(segment_0_to_3, boot0_enter);
  if (err != ESP_OK) {
    bl_resume_scan(scan_was);
    return err;
  }

  err = bl_send_go_at_addr(addr);

done:
  (void)stm32_i2c_bl_release_all_run_app();
  bl_resume_scan(scan_was);
  return err;
}

typedef esp_err_t (*stm32_bl_flash_fill_fn)(void *ctx, size_t off, uint8_t *dst,
                                            size_t len);

static esp_err_t stm32_bl_fill_from_ram(void *ctx, size_t off, uint8_t *dst,
                                        size_t len) {
  memcpy(dst, (const uint8_t *)ctx + off, len);
  return ESP_OK;
}

static esp_err_t stm32_i2c_bl_flash_binary_impl(
    uint8_t segment_0_to_3, bool boot0_enter, uint32_t flash_base, size_t bin_len,
    stm32_bl_flash_fill_fn fill, void *fill_ctx) {
  const size_t chunk = 128;
  bool scan_was = false;
  bl_pause_scan(&scan_was);

  ESP_LOGI(TAG,
           "[flash_bin] START seg=%u boot0=%d base=0x%08" PRIx32 " size=%u B",
           segment_0_to_3, (int)boot0_enter, flash_base, (unsigned)bin_len);

  esp_err_t err =
      stm32_i2c_bl_select_target(segment_0_to_3, boot0_enter);
  if (err != ESP_OK) {
    bl_resume_scan(scan_was);
    return err;
  }

  ESP_LOGI(TAG, "[flash_bin] GET_ID (0x02) — kontrola ROM I²C bootloaderu…");
  err = bl_send_command_byte_pair(0x02);
  if (err == ESP_FAIL) {
    ESP_LOGW(TAG,
             "[flash_bin] GET_ID 1. pokus NACK/ESP_FAIL — čekám 120 ms a opakuji…");
    vTaskDelay(pdMS_TO_TICKS(120));
    err = bl_send_command_byte_pair(0x02);
  }
  if (err != ESP_OK) {
    ESP_LOGE(TAG,
             "[flash_bin] GET_ID write selhal (%s) na 7-bit 0x%02x — typicky NACK: STM "
             "není v system memory nebo špatná sběrnice. Zkontroluj: kontinuitu ESP "
             "SDA/SCL (GPIO Hall) ↔ STM PB7/PB6, společnou zem, BOOT0 při NRST↑, NRST "
             "polaritu; jiný čip než C031 → adresa v AN2606 (C011=0x64).",
             esp_err_to_name(err), (unsigned)bl_addr7());
    goto restore;
  }
  bl_inter_frame();
  {
    uint8_t gid[5];
    memset(gid, 0, sizeof(gid));
    err = bl_i2c_read(gid, sizeof(gid), 400);
    if (err != ESP_OK) {
      ESP_LOGE(TAG, "[flash_bin] GET_ID read: %s", esp_err_to_name(err));
      goto restore;
    }
    ESP_LOGI(TAG,
             "[flash_bin] GET_ID raw: %02X %02X %02X %02X %02X",
             gid[0], gid[1], gid[2], gid[3], gid[4]);
    if (gid[0] != STM32_ACK) {
      ESP_LOGE(TAG,
               "[flash_bin] GET_ID: první bajt 0x%02x (oček. ACK 0x79) — špatný "
               "protokol nebo jiné zařízení na sběrnici",
               gid[0]);
      err = ESP_ERR_INVALID_RESPONSE;
      goto restore;
    }
    uint16_t pid =
        (uint16_t)(((uint16_t)gid[2] << 8) | (uint16_t)gid[3]);
    ESP_LOGI(TAG,
             "[flash_bin] PID=0x%04X — pokračuji mass erase (0x44)",
             (unsigned)pid);
  }

  err = bl_send_command_byte_pair(0x44);
  if (err != ESP_OK) {
    goto restore;
  }

  uint8_t mass[3] = {0xFF, 0xFF, 0x00};
  mass[2] = bl_xor_buf(mass, 2);
  bl_inter_frame();
  ESP_LOGI(TAG, "[flash_bin] erase: pokus o mass erase…");
  err = bl_i2c_write(mass, sizeof(mass));
  if (err != ESP_OK) {
    goto restore;
  }
  bl_inter_frame();
  err = bl_wait_ack(CONFIG_CHESS_STM32_BL_ERASE_ACK_MS);
  if (err != ESP_OK) {
    ESP_LOGW(TAG,
             "[flash_bin] mass erase: %s → zkouším page erase",
             esp_err_to_name(err));
    err = stm32_i2c_bl_select_target(segment_0_to_3, boot0_enter);
    if (err != ESP_OK) {
      goto restore;
    }

    const unsigned psize = (unsigned)CONFIG_CHESS_STM32_BL_FLASH_PAGE_SIZE;
    unsigned pages = (unsigned)((bin_len + psize - 1) / psize);
    ESP_LOGI(TAG, "[flash_bin] page erase: %u stránek à %u B", pages, psize);
    for (unsigned pg = 0; pg < pages && err == ESP_OK; pg++) {
      ESP_LOGI(TAG, "[flash_bin] mazání stránky %u / %u…", pg + 1, pages);
      err = bl_send_command_byte_pair(0x44);
      if (err != ESP_OK) {
        break;
      }
      uint8_t nb[3] = {0x00, 0x00, 0x00};
      nb[2] = bl_xor_buf(nb, 2);
      bl_inter_frame();
      err = bl_i2c_write(nb, sizeof(nb));
      if (err != ESP_OK) {
        break;
      }
      bl_inter_frame();
      err = bl_wait_ack(800);
      if (err != ESP_OK) {
        break;
      }

      uint8_t pn[3] = {(uint8_t)((pg >> 8) & 0xFF), (uint8_t)(pg & 0xFF), 0};
      pn[2] = bl_xor_buf(pn, 2);
      bl_inter_frame();
      err = bl_i2c_write(pn, sizeof(pn));
      if (err != ESP_OK) {
        break;
      }
      bl_inter_frame();
      err = bl_wait_ack(CONFIG_CHESS_STM32_BL_ERASE_ACK_MS);
    }
    if (err != ESP_OK) {
      goto restore;
    }
  } else {
    ESP_LOGI(TAG, "[flash_bin] mass erase OK");
  }

  {
    uint8_t chunk_buf[128];
    unsigned total_chunks = (unsigned)((bin_len + chunk - 1) / chunk);
    unsigned ci = 0;
    for (size_t off = 0; off < bin_len && err == ESP_OK; off += chunk) {
      size_t n = bin_len - off;
      if (n > chunk) {
        n = chunk;
      }
      ci++;
      ESP_LOGI(TAG,
               "[flash_bin] zápis chunk %u / %u @ off=%u (%u B)",
               ci, total_chunks, (unsigned)off, (unsigned)n);
      err = fill(fill_ctx, off, chunk_buf, n);
      if (err != ESP_OK) {
        ESP_LOGE(TAG, "[flash_bin] čtení zdroje @%u: %s", (unsigned)off,
                 esp_err_to_name(err));
        break;
      }
      err = bl_write_memory_payload(flash_base + (uint32_t)off, chunk_buf, n);
    }
  }

restore:
  if (err == ESP_OK) {
#if CONFIG_CHESS_STM32_BL_GO_AFTER_FLASH
    esp_err_t go_err = bl_send_go_at_addr(flash_base);
    if (go_err != ESP_OK) {
      ESP_LOGW(TAG,
               "[flash_bin] GO @0x%08" PRIx32 " selhal (%s) — záložně NRST release",
               flash_base, esp_err_to_name(go_err));
    } else {
      ESP_LOGI(TAG, "[flash_bin] GO @0x%08" PRIx32 " OK", flash_base);
      vTaskDelay(pdMS_TO_TICKS(20));
    }
#endif
    ESP_LOGI(TAG, "[flash_bin] KONEC seg=%u OK", segment_0_to_3);
  } else {
    ESP_LOGE(TAG, "[flash_bin] KONEC seg=%u chyba: %s", segment_0_to_3,
             esp_err_to_name(err));
  }

