AlfredKrutina/chess_esp32_c6_devkit/components/stm32_i2c_bootloader/stm32_i2c_bl.c
  (void)stm32_i2c_bl_release_all_run_app();
  bl_resume_scan(scan_was);
  return err;
}

esp_err_t stm32_i2c_bl_flash_binary(uint8_t segment_0_to_3, bool boot0_enter,
                                    uint32_t flash_base, const uint8_t *bin,
                                    size_t bin_len) {
  ESP_RETURN_ON_FALSE(bin && bin_len, ESP_ERR_INVALID_ARG, TAG, "bin");
  return stm32_i2c_bl_flash_binary_impl(segment_0_to_3, boot0_enter, flash_base,
                                        bin_len, stm32_bl_fill_from_ram,
                                        (void *)bin);
}

#else /* !CONFIG_CHESS_STM32_I2C_BL_ENABLE */

esp_err_t stm32_i2c_bl_init(void) { return ESP_ERR_NOT_SUPPORTED; }

esp_err_t stm32_i2c_bl_select_target(uint8_t segment_0_to_3,
                                     bool boot0_enter_bootloader) {
  (void)segment_0_to_3;
  (void)boot0_enter_bootloader;
  return ESP_ERR_NOT_SUPPORTED;
}

esp_err_t stm32_i2c_bl_release_all_run_app(void) {
  return ESP_ERR_NOT_SUPPORTED;
}

esp_err_t stm32_i2c_bl_cmd_get_id(uint8_t segment_0_to_3, bool boot0_enter,
                                  uint16_t *pid_out) {
  (void)segment_0_to_3;
  (void)boot0_enter;
  (void)pid_out;
  return ESP_ERR_NOT_SUPPORTED;
}

esp_err_t stm32_i2c_bl_erase_all(uint8_t segment_0_to_3, bool boot0_enter) {
  (void)segment_0_to_3;
  (void)boot0_enter;
  return ESP_ERR_NOT_SUPPORTED;
}

esp_err_t stm32_i2c_bl_write_memory(uint8_t segment_0_to_3, bool boot0_enter,
                                    uint32_t addr, const uint8_t *data,
                                    size_t len) {
  (void)segment_0_to_3;
  (void)boot0_enter;
  (void)addr;
  (void)data;
  (void)len;
  return ESP_ERR_NOT_SUPPORTED;
}

esp_err_t stm32_i2c_bl_go(uint8_t segment_0_to_3, bool boot0_enter,
                          uint32_t addr) {
  (void)segment_0_to_3;
  (void)boot0_enter;
  (void)addr;
  return ESP_ERR_NOT_SUPPORTED;
}

esp_err_t stm32_i2c_bl_flash_binary(uint8_t segment_0_to_3, bool boot0_enter,
                                    uint32_t flash_base, const uint8_t *bin,
                                    size_t bin_len) {
  (void)segment_0_to_3;
  (void)boot0_enter;
  (void)flash_base;
  (void)bin;
  (void)bin_len;
  return ESP_ERR_NOT_SUPPORTED;
}

#endif /* !CONFIG_CHESS_STM32_I2C_BL_ENABLE */

#if CONFIG_CHESS_STM32_I2C_BL_ENABLE && CONFIG_CHESS_STM32_BL_AUTO_FLASH_ON_BOOT

static esp_err_t stm32_bl_fill_from_partition(void *ctx, size_t off, uint8_t *dst,
                                              size_t len) {
  return esp_partition_read((const esp_partition_t *)ctx, off, dst, len);
}

/** Délka obsahu bez koncových 0xFF (čtení po blocích od konce — bez velkého malloc). */
static esp_err_t auto_part_effective_bytes(const esp_partition_t *part,
                                           size_t *effp) {
  uint8_t buf[2048];
  size_t eff = part->size;
  while (eff > 0) {
    const size_t chunk_sz = eff > sizeof(buf) ? sizeof(buf) : eff;
    const size_t pos = eff - chunk_sz;
    esp_err_t e = esp_partition_read(part, pos, buf, chunk_sz);
    if (e != ESP_OK) {
      return e;
    }
    size_t i = chunk_sz;
    while (i > 0 && buf[i - 1] == 0xFF) {
      i--;
    }
    if (i > 0) {
      *effp = pos + i;
      return ESP_OK;
    }
    eff = pos;
  }
  *effp = 0;
  return ESP_OK;
}

static esp_err_t auto_part_crc32(const esp_partition_t *part, size_t len,
                                 uint32_t *crc_out) {
  uint8_t buf[1024];
  uint32_t crc = 0;
  size_t off = 0;
  while (off < len) {
    size_t n = len - off > sizeof(buf) ? sizeof(buf) : len - off;
    esp_err_t e = esp_partition_read(part, off, buf, n);
    if (e != ESP_OK) {
      return e;
    }
    crc = esp_rom_crc32_le(crc, buf, n);
    off += n;
  }
  *crc_out = crc;
  return ESP_OK;
}

#endif /* BL_ENABLE && AUTO_FLASH_ON_BOOT */

#if CONFIG_CHESS_STM32_I2C_BL_ENABLE && CONFIG_CHESS_MATRIX_INPUT_I2C_HALL

static uint8_t bl_hall_segment_addr7(unsigned seg) {
  switch (seg) {
  case 0:
    return (uint8_t)CONFIG_CHESS_HALL_SEG0_ADDR;
  case 1:
    return (uint8_t)CONFIG_CHESS_HALL_SEG1_ADDR;
  case 2:
    return (uint8_t)CONFIG_CHESS_HALL_SEG2_ADDR;
  case 3:
    return (uint8_t)CONFIG_CHESS_HALL_SEG3_ADDR;
  default:
    return (uint8_t)CONFIG_CHESS_HALL_SEG0_ADDR;
  }
}

static esp_err_t bl_probe_hall_segment_once(uint8_t seg, int timeout_ms) {
  uint8_t addr = bl_hall_segment_addr7(seg);
  uint8_t reg = (uint8_t)CONFIG_CHESS_HALL_REG_START;
  uint8_t buf[2];
  return i2c_master_write_read_device(bl_port(), addr, &reg, 1, buf,
                                      sizeof(buf), pdMS_TO_TICKS(timeout_ms));
}

static esp_err_t bl_probe_hall_segment_retries(uint8_t seg) {
  const unsigned tries =
      (unsigned)CONFIG_CHESS_STM32_BL_HALL_PROBE_RETRIES;
  const int gap_ms = CONFIG_CHESS_STM32_BL_HALL_PROBE_RETRY_MS;
  esp_err_t last = ESP_FAIL;

  for (unsigned t = 0; t < tries; t++) {
    last = bl_probe_hall_segment_once(seg, 120);
    if (last == ESP_OK) {
      return ESP_OK;
    }
    if (t + 1u < tries) {
      vTaskDelay(pdMS_TO_TICKS(gap_ms));
    }
  }
  return last;
}

/** Ověří Hall odpověď u všech segmentů, které mají NRST GPIO. */
static bool bl_probe_all_nrst_hall_segments(bool log_ok) {
  bool all_ok = true;
  bool any = false;

  for (unsigned seg = 0; seg < 4; seg++) {
    if (NRST_CFG(seg) < 0) {
      continue;
    }
    any = true;
    esp_err_t pe = bl_probe_hall_segment_retries((uint8_t)seg);
    if (pe != ESP_OK) {
      ESP_LOGW(TAG,
               "[hall_probe] seg%u addr 0x%02x neodpovídá (%s)",
               seg, bl_hall_segment_addr7(seg), esp_err_to_name(pe));
      all_ok = false;
    } else if (log_ok) {
      ESP_LOGI(TAG, "[hall_probe] seg%u addr 0x%02x OK", seg,
               bl_hall_segment_addr7(seg));
    }
  }

  if (!any) {
    ESP_LOGD(TAG, "[hall_probe] žádný NRST GPIO — přeskočeno");
    return true;
  }
  return all_ok;
}

#endif /* BL + HALL */

#if CONFIG_CHESS_STM32_I2C_BL_ENABLE && CONFIG_CHESS_STM32_BL_AUTO_FLASH_ON_BOOT
static SemaphoreHandle_t s_boot_flash_done_sem;

