AlfredKrutina/chess_esp32_c6_devkit/components/stm32_i2c_bootloader/stm32_i2c_bl.c
void stm32_i2c_bl_boot_flash_sync_prepare(void) {
  if (s_boot_flash_done_sem != NULL) {
    return;
  }
  s_boot_flash_done_sem = xSemaphoreCreateBinary();
  if (s_boot_flash_done_sem == NULL) {
    ESP_LOGE(TAG, "boot_flash_sync: xSemaphoreCreateBinary failed");
  }
}

static void stm32_i2c_bl_boot_flash_sync_signal_done(void) {
  if (s_boot_flash_done_sem != NULL) {
    (void)xSemaphoreGive(s_boot_flash_done_sem);
  }
}

void stm32_i2c_bl_boot_flash_sync_wait(TickType_t timeout_ticks) {
  if (s_boot_flash_done_sem == NULL) {
    return;
  }
  if (xSemaphoreTake(s_boot_flash_done_sem, timeout_ticks) != pdTRUE) {
    ESP_LOGW(TAG,
             "boot_flash_sync: timeout — STM32 auto-flash nedokončeno v čase "
             "(zkontroluj I²C / NRST / BOOT0)");
  }
}
#else
void stm32_i2c_bl_boot_flash_sync_prepare(void) {}

void stm32_i2c_bl_boot_flash_sync_wait(TickType_t timeout_ticks) {
  (void)timeout_ticks;
}
#endif

void stm32_i2c_bl_maybe_auto_flash_on_boot(void) {
#if CONFIG_CHESS_STM32_I2C_BL_ENABLE && CONFIG_CHESS_STM32_BL_AUTO_FLASH_ON_BOOT
  static const char *TAG_A = "STM32_AUTO";

  esp_err_t ie = stm32_i2c_bl_init();
  if (ie != ESP_OK) {
    ESP_LOGE(TAG_A, "stm32_i2c_bl_init: %s", esp_err_to_name(ie));
    goto out;
  }

  ESP_LOGI(TAG_A, "=== auto-flash on boot (oddíl '%s') ===",
           CONFIG_CHESS_STM32_BL_AUTO_PARTITION_LABEL);

#if CONFIG_CHESS_STM32_BL_AUTO_USE_BOOT0
  if (CONFIG_CHESS_STM32_BL_BOOT0_GPIO < 0) {
    ESP_LOGE(TAG_A,
             "AUTO_USE_BOOT0 je zapnuto, ale CHESS_STM32_BL_BOOT0_GPIO=-1. "
             "Tovární / prázdný STM na hlavní flash nespustí tvůj Hall kód ani ROM bootloader "
             "na sběrnici — bez vstupu do system memory (BOOT0=VDD při uvolnění NRST) ESP "
             "neosloví bootloader na adrese 0x%02x. Nastav v menuconfig BOOT0 GPIO a zapoj "
             "jej na pin BOOT0 MCU (nebo vypni AUTO_USE_BOOT0 a drž BOOT0 ručně jumperem).",
             (unsigned)CONFIG_CHESS_STM32_BL_TARGET_ADDR7);
    goto out;
  }
#endif

  const esp_partition_t *part = esp_partition_find_first(
      ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY,
      CONFIG_CHESS_STM32_BL_AUTO_PARTITION_LABEL);
  if (part == NULL) {
    ESP_LOGW(TAG_A, "oddíl '%s' nenalezen — auto-flash přeskočen",
             CONFIG_CHESS_STM32_BL_AUTO_PARTITION_LABEL);
    goto out;
  }

  ESP_LOGI(TAG_A, "oddíl: offset=0x%08" PRIx32 " size=%" PRIu32 " B",
           (uint32_t)part->address, (uint32_t)part->size);

  size_t eff = 0;
  esp_err_t tre = auto_part_effective_bytes(part, &eff);
  if (tre != ESP_OK) {
    ESP_LOGE(TAG_A, "ořez konce oddílu: %s", esp_err_to_name(tre));
    goto out;
  }

  if (eff < 32) {
    ESP_LOGW(TAG_A, "image z oddílu je prázdná nebo jen 0xFF (eff=%u B)",
             (unsigned)eff);
    goto out;
  }

  if (CONFIG_CHESS_STM32_BL_AUTO_FLASH_MAX_BYTES > 0 &&
      eff > (size_t)CONFIG_CHESS_STM32_BL_AUTO_FLASH_MAX_BYTES) {
    eff = (size_t)CONFIG_CHESS_STM32_BL_AUTO_FLASH_MAX_BYTES;
  }

  uint32_t crc = 0;
  esp_err_t cre = auto_part_crc32(part, eff, &crc);
  if (cre != ESP_OK) {
    ESP_LOGE(TAG_A, "CRC z oddílu: %s", esp_err_to_name(cre));
    goto out;
  }

  ESP_LOGI(TAG_A,
           "image po ořezu konce 0xFF: %" PRIu32 " B, CRC32=0x%08" PRIx32
           " (čtení po blocích, bez malloc %" PRIu32 ")",
           (uint32_t)eff, crc, (uint32_t)part->size);

#if CONFIG_CHESS_STM32_BL_AUTO_FLASH_SKIP_IF_UNCHANGED
  /* FORCE v sdkconfig často chybí jako makro (# is not set) — nepoužívat přímo !CONFIG_FORCE */
#if !(defined(CONFIG_CHESS_STM32_BL_AUTO_FLASH_FORCE) && CONFIG_CHESS_STM32_BL_AUTO_FLASH_FORCE)
  {
    nvs_handle_t h;
    if (nvs_open("stm32_bl", NVS_READONLY, &h) == ESP_OK) {
      uint32_t oc = 0;
      uint32_t ol = 0;
      esp_err_t ge1 = nvs_get_u32(h, "af_crc", &oc);
      esp_err_t ge2 = nvs_get_u32(h, "af_len", &ol);
      nvs_close(h);
      if (ge1 == ESP_OK && ge2 == ESP_OK && oc == crc &&
          ol == (uint32_t)eff) {
#if CONFIG_CHESS_STM32_BL_REFLASH_IF_HALL_MISSING &&                          \
    CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
        if (!bl_probe_all_nrst_hall_segments(false)) {
          ESP_LOGW(TAG_A,
                   "NVS říká stejný image, ale Hall neodpovídá — "
                   "vynucuji auto-flash (výměna STM / prázdný čip?)");
        } else
#endif
        {
          ESP_LOGI(TAG_A,
                   "auto-flash přeskočen (stejný obsah CRC=0x%08" PRIx32
                   ", %" PRIu32 " B)",
                   crc, (uint32_t)eff);
#if CONFIG_CHESS_STM32_BL_VERIFY_HALL_AFTER_FLASH &&                            \
    CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
          (void)bl_probe_all_nrst_hall_segments(true);
#endif
          goto out;
        }
      }
    }
  }
#endif
#endif

  bool use_boot = CONFIG_CHESS_STM32_BL_AUTO_USE_BOOT0 &&
                  CONFIG_CHESS_STM32_BL_BOOT0_GPIO >= 0;
  uint32_t base = (uint32_t)CONFIG_CHESS_STM32_BL_AUTO_FLASH_BASE;
  ESP_LOGI(TAG_A,
           "parametry: FLASH_BASE=0x%08" PRIx32 " USE_BOOT0=%d "
           "(BOOT0 GPIO=%d)",
           base, use_boot ? 1 : 0, CONFIG_CHESS_STM32_BL_BOOT0_GPIO);

  bool any_nrst = false;
  bool all_ok = true;
  for (unsigned seg = 0; seg < 4; seg++) {
    int nrst = seg == 0   ? CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG0
               : seg == 1 ? CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG1
               : seg == 2 ? CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG2
                          : CONFIG_CHESS_STM32_BL_NRST_GPIO_SEG3;
    if (nrst < 0) {
      continue;
    }
    any_nrst = true;
    ESP_LOGI(TAG_A, "segment %u: nahrávám %" PRIu32 " B → STM @0x%08" PRIx32,
             seg, (uint32_t)eff, base);
    esp_err_t fe = stm32_i2c_bl_flash_binary_impl(
        (uint8_t)seg, use_boot, base, eff, stm32_bl_fill_from_partition,
        (void *)part);
    if (fe != ESP_OK) {
      ESP_LOGE(TAG_A, "segment %u: %s", seg, esp_err_to_name(fe));
      all_ok = false;
    } else {
      ESP_LOGI(TAG_A, "segment %u: hotovo", seg);
    }
  }

  if (!any_nrst) {
    ESP_LOGW(TAG_A,
             "žádný NRST GPIO — nastav CHESS_STM32_BL_NRST_GPIO_SEG* v menuconfig");
  }

  if (all_ok && any_nrst) {
    nvs_handle_t hw;
    if (nvs_open("stm32_bl", NVS_READWRITE, &hw) == ESP_OK) {
      nvs_set_u32(hw, "af_crc", crc);
      nvs_set_u32(hw, "af_len", (uint32_t)eff);
      nvs_commit(hw);
      nvs_close(hw);
      ESP_LOGI(TAG_A, "NVS: uložen CRC+délka (další boot přeskočí při stejném obsahu)");
    }
#if CONFIG_CHESS_STM32_BL_VERIFY_HALL_AFTER_FLASH &&                          \
    CONFIG_CHESS_MATRIX_INPUT_I2C_HALL
    if (!bl_probe_all_nrst_hall_segments(true)) {
      ESP_LOGE(TAG_A,
               "auto-flash zápis OK, ale Hall neodpovídá — zkontroluj NRST, "
               "BOOT0 release a zapojení I2C (PB6/PB7)");
    }
#endif
  } else if (any_nrst && !all_ok) {
    ESP_LOGE(TAG_A,
             "auto-flash selhal na alespoň jednom segmentu — Hall čtení "
             "nebude fungovat");
  }

out:
  stm32_i2c_bl_boot_flash_sync_signal_done();

#endif /* AUTO_FLASH_ON_BOOT && BL */
}
